  var chinaprovinces=document.weather.province.options.length /////该省份在数组中的索引
  var c=new Array(chinaprovinces); /////////////实例化长度是chinaprovinces的数组
  var n=new Array(chinaprovinces);
  for (i=0; i<chinaprovinces; i++)  c[i]=new Array();
  c[0] = new Array("选择城市");
       c[1] = new Array("北京","上海","天津","重庆");
       c[2] = new Array("香港","澳门");
       c[3] = new Array("哈尔滨","齐齐哈尔","牡丹江","大庆","伊春","双鸭山","鹤岗","鸡西","佳木斯","七台河","黑河","绥化","大兴安岭");
       c[4] = new Array("长春","延边","吉林","白山","白城","四平","松原","辽源","大安","通化");
       c[5] = new Array("沈阳","大连","葫芦岛","盘锦","本溪","抚顺","铁岭","辽阳","营口","阜新","朝阳","锦州","丹东","鞍山");
       c[6] = new Array("呼和浩特","呼伦贝尔","锡林浩特","包头","赤峰","海拉尔","乌海","鄂尔多斯","通辽");
       c[7] = new Array("石家庄","唐山","张家口","廊坊","邢台","邯郸","沧州","衡水","承德","保定","秦皇岛");
       c[8] = new Array("郑州","开封","洛阳","平顶山","焦作","鹤壁","新乡","安阳","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店");
       c[9] = new Array("济南","青岛","淄博","威海","曲阜","临沂","烟台","枣庄","聊城","济宁","菏泽","泰安","日照","东营","德州","滨州","莱芜","潍坊");
       c[10] = new Array("太原","阳泉","晋城","晋中","临汾","运城","长治","朔州","忻州","大同","吕梁");
       c[11] = new Array("南京","苏州","昆山","南通","太仓","吴县","徐州","宜兴","镇江","淮安","常熟","盐城","泰州","无锡","连云港","扬州","常州","宿迁");
       c[12] = new Array("合肥","巢湖","蚌埠","安庆","六安","滁州","马鞍山","阜阳","宣城","铜陵","淮北","芜湖","毫州","宿州","淮南","池州");
       c[13] = new Array("西安","韩城","安康","汉中","宝鸡","咸阳","榆林","渭南","商洛","铜川","延安");
       c[14] = new Array("银川","固原","中卫","石嘴山","吴忠");
       c[15] = new Array("兰州","白银","庆阳","酒泉","天水","武威","张掖","甘南","临夏","平凉","定西","金昌");
       c[16] = new Array("西宁","海北","海西","黄南","果洛","玉树","海东","海南");
       c[17] = new Array("武汉","宜昌","黄冈","恩施","荆州","神农架","十堰","咸宁","襄樊","孝感","随州","黄石","荆门","鄂州");
       c[18] = new Array("长沙","邵阳","常德","郴州","吉首","株洲","娄底","湘潭","益阳","永州","岳阳","衡阳","怀化","韶山","张家界");
       c[19] = new Array("杭州","湖州","金华","宁波","丽水","绍兴","雁荡山","衢州","嘉兴","台州","舟山","温州");
       c[20] = new Array("南昌","萍乡","九江","上饶","抚州","吉安","鹰潭","宜春","新余","景德镇","赣州");
       c[21] = new Array("福州","厦门","龙岩","南平","宁德","莆田","泉州","三明","漳州");
       c[22] = new Array("贵阳","安顺","赤水","遵义","铜仁","六盘水","毕节","凯里","都匀");
       c[23] = new Array("成都","泸州","内江","凉山","阿坝","巴中","广元","乐山","绵阳","德阳","攀枝花","雅安","宜宾","自贡","甘孜州","达州","资阳","广安","遂宁","眉山","南充");
       c[24] = new Array("广州","深圳","潮州","韶关","湛江","惠州","清远","东莞","江门","茂名","肇庆","汕尾","河源","揭阳","梅州","中山","德庆","阳江","云浮","珠海","汕头","佛山");
       c[25] = new Array("南宁","桂林","阳朔","柳州","梧州","玉林","桂平","贺州","钦州","贵港","防城港","百色","北海","河池","来宾","崇左");
       c[26] = new Array("昆明","保山","楚雄","德宏","红河","临沧","怒江","曲靖","思茅","文山","玉溪","昭通","丽江","大理");
       c[27] = new Array("海口","三亚","儋州","琼山","通什","文昌");
       c[28] = new Array("乌鲁木齐","阿勒泰","阿克苏","昌吉","哈密","和田","喀什","克拉玛依","石河子","塔城","库尔勒","吐鲁番","伊宁");
       c[29] = new Array("拉萨","阿里","昌都","那曲","日喀则","山南","林芝");
       c[30] = new Array("台北","高雄");
  for (i=0; i<chinaprovinces; i++)  n[i]=new Array();
       n[0] = new Array("选择城市");
       n[1] = new Array("北京","上海","天津","重庆");
       n[2] = new Array("香港","澳门");
       n[3] = new Array("哈尔滨","齐齐哈尔","牡丹江","大庆","伊春","双鸭山","鹤岗","鸡西","佳木斯","七台河","黑河","绥化","大兴安岭");
       n[4] = new Array("长春","延边","吉林","白山","白城","四平","松原","辽源","大安","通化");
       n[5] = new Array("沈阳","大连","葫芦岛","盘锦","本溪","抚顺","铁岭","辽阳","营口","阜新","朝阳","锦州","丹东","鞍山");
       n[6] = new Array("呼和浩特","呼伦贝尔","锡林浩特","包头","赤峰","海拉尔","乌海","鄂尔多斯","通辽");
       n[7] = new Array("石家庄","唐山","张家口","廊坊","邢台","邯郸","沧州","衡水","承德","保定","秦皇岛");
       n[8] = new Array("郑州","开封","洛阳","平顶山","焦作","鹤壁","新乡","安阳","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店");
       n[9] = new Array("济南","青岛","淄博","威海","曲阜","临沂","烟台","枣庄","聊城","济宁","菏泽","泰安","日照","东营","德州","滨州","莱芜","潍坊");
       n[10] = new Array("太原","阳泉","晋城","晋中","临汾","运城","长治","朔州","忻州","大同","吕梁");
       n[11] = new Array("南京","苏州","昆山","南通","太仓","吴县","徐州","宜兴","镇江","淮安","常熟","盐城","泰州","无锡","连云港","扬州","常州","宿迁");
       n[12] = new Array("合肥","巢湖","蚌埠","安庆","六安","滁州","马鞍山","阜阳","宣城","铜陵","淮北","芜湖","毫州","宿州","淮南","池州");
       n[13] = new Array("西安","韩城","安康","汉中","宝鸡","咸阳","榆林","渭南","商洛","铜川","延安");
       n[14] = new Array("银川","固原","中卫","石嘴山","吴忠");
       n[15] = new Array("兰州","白银","庆阳","酒泉","天水","武威","张掖","甘南","临夏","平凉","定西","金昌");
       n[16] = new Array("西宁","海北","海西","黄南","果洛","玉树","海东","海南");
       n[17] = new Array("武汉","宜昌","黄冈","恩施","荆州","神农架","十堰","咸宁","襄樊","孝感","随州","黄石","荆门","鄂州");
       n[18] = new Array("长沙","邵阳","常德","郴州","吉首","株洲","娄底","湘潭","益阳","永州","岳阳","衡阳","怀化","韶山","张家界");
       n[19] = new Array("杭州","湖州","金华","宁波","丽水","绍兴","雁荡山","衢州","嘉兴","台州","舟山","温州");
       n[20] = new Array("南昌","萍乡","九江","上饶","抚州","吉安","鹰潭","宜春","新余","景德镇","赣州");
       n[21] = new Array("福州","厦门","龙岩","南平","宁德","莆田","泉州","三明","漳州");
       n[22] = new Array("贵阳","安顺","赤水","遵义","铜仁","六盘水","毕节","凯里","都匀");
       n[23] = new Array("成都","泸州","内江","凉山","阿坝","巴中","广元","乐山","绵阳","德阳","攀枝花","雅安","宜宾","自贡","甘孜州","达州","资阳","广安","遂宁","眉山","南充");
       n[24] = new Array("广州","深圳","潮州","韶关","湛江","惠州","清远","东莞","江门","茂名","肇庆","汕尾","河源","揭阳","梅州","中山","德庆","阳江","云浮","珠海","汕头","佛山");
       n[25] = new Array("南宁","桂林","阳朔","柳州","梧州","玉林","桂平","贺州","钦州","贵港","防城港","百色","北海","河池","来宾","崇左");
       n[26] = new Array("昆明","保山","楚雄","德宏","红河","临沧","怒江","曲靖","思茅","文山","玉溪","昭通","丽江","大理");
       n[27] = new Array("海口","三亚","儋州","琼山","通什","文昌");
       n[28] = new Array("乌鲁木齐","阿勒泰","阿克苏","昌吉","哈密","和田","喀什","克拉玛依","石河子","塔城","库尔勒","吐鲁番","伊宁");
       n[29] = new Array("拉萨","阿里","昌都","那曲","日喀则","山南","林芝");
       n[30] = new Array("台北","高雄");
  ///////////////
  function Province_onchange(x)
  {
   for (m=document.weather.chinacity.options.length-1;m>0;m--) ///////////清空列表
    document.weather.chinacity.options[m]=null
    for (i=0;i<c[x].length;i++)////////////给列表重新赋值
     {
      document.weather.chinacity.options[i]=new Option(c[x][i],n[x][i]);
     }
   document.weather.chinacity.options[0].selected=true; //////默认第一个显示
  }
  ///////////
  function Provinceset(name)
  {
   for (i=0;i<document.weather.province.options.length;i++){
     if (document.weather.province.options[i].value==name){
       document.weather.province.options[i].selected=true;
       break;
     }
   }
  }
  Provinceset("选择省");
